// Напишите прорамму, которая на вход принимает число N а на выходе показывает все четные числа от 1 до N

Console.Write("Введите целоче число: ");
string userInput = Console.ReadLine() ?? "";
int number = int.Parse(userInput);
int sum = 2;
int result = 0;

difference = number - 0;
result = number % 2;

while
{

}
if (number >= 2)
{

}
